<?php
	session_start();
	require_once 'bd.php';// файл bd.php должен быть в той же папке, что и все остальные, если это не так, то просто измените путь 


	$title="Сайт клана Миф";
	require 'html_head.php';	
	echo'<section id="mainunit">';
			require 'leftmenu.php';
			require 'rightmenu.php';

		echo'<section id="centerunit">';
			 require 'mainmenu.php';?>
			<article class="centercontent">
				<header class="main">Центр</header>
					<p>Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях. Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о 			происхождении всего сущего, о богах и героях.	Миф в литературе — сказание, передающее представления людей о мире, месте человека в нём, о происхождении всего сущего, о богах и героях.				
					</p>
			</article>
            
            <!--Всплывающее окно-->
           
      		<!--/////-->
            
		</section>
     </section>
<?php 
	require 'html_foot.php'; 
?>